app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY created_at DESC
---
      def index
        articles = Article.order('created_at DESC');

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 8 LIMIT 1
---
      def show
        article = Article.find(params[:id])

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('testAPI', 'This is Test API Body', '2022-03-01 17:19:40.361133', '2022-03-01 17:19:40.361133')
---
      def create
        article = Article.new(article_params)

        if article.save